#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Ура!'");
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура Ура(Команда)
	СоздатьНовыйЭлемент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьНовыйЭлемент()
	МужскиеИмена = СтрРазделить("Александр,Алексей,Андрей,Артём,Дмитрий,Егор,Иван,"
		+ "Максим,Михаил,Николай,Сергей", ",", Ложь);
	Генератор = Новый ГенераторСлучайныхЧисел();
	Имя = МужскиеИмена[Генератор.СлучайноеЧисло(0, МужскиеИмена.Количество() - 1)];

	НовыйЭлемент = Справочники.Справочник0810.СоздатьЭлемент();
	НовыйЭлемент.Наименование = Имя;
	НовыйЭлемент.Записать();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создан элемент: " + НовыйЭлемент.Наименование;
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти



